In [52]:
import pandas as pd

In [53]:
df = pd.read_csv('../data/spray.csv')

In [54]:
df.shape

(14835, 4)

In [55]:
df.drop_duplicates(inplace=True)

In [56]:
df.head()

         Date        Time   Latitude  Longitude
0  2011-08-29  6:56:58 PM  42.391623 -88.089163
1  2011-08-29  6:57:08 PM  42.391348 -88.089163
2  2011-08-29  6:57:18 PM  42.391022 -88.089157
3  2011-08-29  6:57:28 PM  42.390637 -88.089158
4  2011-08-29  6:57:38 PM  42.390410 -88.088858

In [57]:
df.dropna(inplace=True)

In [58]:
df.isnull().sum()

Date         0
Time         0
Latitude     0
Longitude    0
dtype: int64

In [59]:
df.shape

(13710, 4)

In [60]:
df["DateTime"] = df.Date + " " + df.Time

In [61]:
df.DateTime.head()

0    2011-08-29 6:56:58 PM
1    2011-08-29 6:57:08 PM
2    2011-08-29 6:57:18 PM
3    2011-08-29 6:57:28 PM
4    2011-08-29 6:57:38 PM
Name: DateTime, dtype: object

In [62]:
df['DateTime']= pd.to_datetime(df['DateTime'])
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13710 entries, 0 to 14834
Data columns (total 5 columns):
Date         13710 non-null object
Time         13710 non-null object
Latitude     13710 non-null float64
Longitude    13710 non-null float64
DateTime     13710 non-null datetime64[ns]
dtypes: datetime64[ns](1), float64(2), object(2)
memory usage: 642.7+ KB

In [63]:
df.drop(['Time'],axis=1,inplace=True)

In [64]:
df.head()

         Date   Latitude  Longitude            DateTime
0  2011-08-29  42.391623 -88.089163 2011-08-29 18:56:58
1  2011-08-29  42.391348 -88.089163 2011-08-29 18:57:08
2  2011-08-29  42.391022 -88.089157 2011-08-29 18:57:18
3  2011-08-29  42.390637 -88.089158 2011-08-29 18:57:28
4  2011-08-29  42.390410 -88.088858 2011-08-29 18:57:38

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13710 entries, 0 to 14834
Data columns (total 4 columns):
Date         13710 non-null object
Latitude     13710 non-null float64
Longitude    13710 non-null float64
DateTime     13710 non-null datetime64[ns]
dtypes: datetime64[ns](1), float64(2), object(1)
memory usage: 535.5+ KB

In [66]:
df.DateTime.unique()

array(['2011-08-29T18:56:58.000000000', '2011-08-29T18:57:08.000000000',
       '2011-08-29T18:57:18.000000000', ...,
       '2013-09-05T20:35:21.000000000', '2013-09-05T20:35:31.000000000',
       '2013-09-05T20:35:41.000000000'], dtype='datetime64[ns]')

In [78]:
df[df.duplicated()]

Empty DataFrame
Columns: [Date, Latitude, Longitude, DateTime]
Index: []

In [76]:
df.Date.unique()

array(['2011-08-29', '2011-09-07', '2013-07-17', '2013-07-25',
       '2013-08-08', '2013-08-15', '2013-08-16', '2013-08-22',
       '2013-08-29', '2013-09-05'], dtype=object)

In [70]:
df.to_csv('../data/updated_spray.csv')